CREATE TABLE `test`.`booksky` (
  `ID` INT NOT NULL AUTO_INCREMENT,
  `TITLE` VARCHAR(100) NOT NULL,
  `DESCRIPTION` VARCHAR(255) NOT NULL,
  `AUTHOR` VARCHAR(100) NOT NULL,
  `ISBN` VARCHAR(20) NOT NULL,
  `PRINT_YEAR` INT NOT NULL,
  `READ_ALREADY` TINYINT(1) NOT NULL,
  PRIMARY KEY (`ID`))
ENGINE = InnoDB
DEFAULT CHARACTER SET = utf8;

ALTER TABLE test.booksky ALTER READ_ALREADY SET DEFAULT 0;

INSERT INTO test.booksky ( `TITLE`, `DESCRIPTION`, `AUTHOR`, `ISBN`, `PRINT_YEAR`) VALUES


('название1', 'описание1', 'автор1', 'isbn1', 2034),
('название2', 'описание2', 'автор2', 'isbn2', 2047),
('название3', 'описание3', 'автор3', 'isbn3', 2023),
('название4', 'описание4', 'автор4', 'isbn4', 2001),
('название5', 'описание5', 'автор5', 'isbn5', 2011),
('название6', 'описание6', 'автор6', 'isbn6', 1961),
('название7', 'описание7', 'автор7', 'isbn7', 1978),
('название8', 'описание8', 'автор8', 'isbn8', 2000),
('название9', 'описание9', 'автор9', 'isbn9', 1961),
('название10', 'описание10', 'автор10', 'isbn10', 2018),
('название11', 'описание11', 'автор11', 'isbn11', 2012),
('название12', 'описание12', 'автор12', 'isbn12', 1977),
('название13', 'описание13', 'автор13', 'isbn13', 2036),
('название14', 'описание14', 'автор14', 'isbn14', 1999),
('название15', 'описание15', 'автор15', 'isbn15', 1967),
('название16', 'описание16', 'автор16', 'isbn16', 1972),
('название17', 'описание17', 'автор17', 'isbn17', 2019),
('название18', 'описание18', 'автор18', 'isbn18', 1951),
('название19', 'описание19', 'автор19', 'isbn19', 1990),
('название20', 'описание20', 'автор20', 'isbn20', 2041),
('название21', 'описание21', 'автор21', 'isbn21', 2034),
('название22', 'описание22', 'автор22', 'isbn22', 2020),
('название23', 'описание23', 'автор23', 'isbn23', 1951),
('название24', 'описание24', 'автор24', 'isbn24', 2013),
('название25', 'описание25', 'автор25', 'isbn25', 1953),
('название26', 'описание26', 'автор26', 'isbn26', 2015),
('название27', 'описание27', 'автор27', 'isbn27', 1993),
('название28', 'описание28', 'автор28', 'isbn28', 2041),
('название29', 'описание29', 'автор29', 'isbn29', 1980),
('название30', 'описание30', 'автор30', 'isbn30', 1980),
('название31', 'описание31', 'автор31', 'isbn31', 1988),
('название32', 'описание32', 'автор32', 'isbn32', 2037),
('название33', 'описание33', 'автор33', 'isbn33', 2047),
('название34', 'описание34', 'автор34', 'isbn34', 2007);